app/controllers/produtos_controller.rb

INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "linkImagem", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save